/*
 * Phoenix-RTOS
 *
 * Operating system loader
 *
 * GRLIB NANDFCTRL2 flash driver
 *
 * Low-level driver using DMA Linked List Mode (LLM).
 *
 * Copyright 2026 Phoenix Systems
 * Author: Lukasz Leczkowski
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <hal/hal.h>
#include <lib/lib.h>

#include "nandfctrl2.h"
#include "onfi-4.h"


#define NAND_BBM_SIZE         2 /* Bad Block Marker size in bytes */
#define ECC_BITFLIP_THRESHOLD 5 /* Min number of bitflips to treat page as degrading */

#define DMA_MAX_DESCS 32 /* Maximum descriptors in a single chain */


/* ======================== Register Definitions ======================== */


/* Core control 0 register */
#define CTRL0_EE         (1U << 13)               /* EDAC enable */
#define CTRL0_RE         (1U << 12)               /* Data randomization enable */
#define CTRL0_LLM        (1U << 10)               /* Linked list mode enable */
#define CTRL0_BBM        (1U << 9)                /* Preserve Bad Block Marking */
#define CTRL0_EDO        (1U << 7)                /* EDO mode enable */
#define CTRL0_IFSEL_SHFT 5                        /* Data Interface select shift */
#define CTRL0_IFSEL_MSK  (3U << CTRL0_IFSEL_SHFT) /* Data Interface select mask */
#define CTRL0_MSEL_SHFT  3                        /* Memory select shift */
#define CTRL0_MSEL_MSK   (3U << CTRL0_MSEL_SHFT)  /* Memory select mask */

/* Core control 2 register */
#define CTRL2_STOP_LL (1U << 3) /* Stop Linked List */

#define STS1_ABORT  (1U << 8) /* Abort interrupt (set when abort completes) */
#define STS1_TMOUT  (1U << 6) /* Ready/Busy timeout */
#define STS1_CMD    (1U << 5) /* Invalid command */
#define STS1_DL     (1U << 4) /* DMA read (uplink write) error */
#define STS1_UL     (1U << 3) /* DMA write (downlink read) error */
#define STS1_DS     (1U << 1) /* Descriptor finished */

#define STS1_FATAL_MSK (STS1_TMOUT | STS1_CMD | STS1_ABORT | STS1_DL | STS1_UL)

/* Descriptor command register */
#define DCMD_CMD2_SHFT   24
#define DCMD_CMD1_SHFT   16
#define DCMD_PRECH       (1U << 12)               /* Pre-cache */
#define DCMD_DD          (1U << 11)               /* Data DMA Disable (1 = APB, 0 = DMA) */
#define DCMD_ED          (1U << 10)               /* EDAC Disable for this descriptor */
#define DCMD_RD          (1U << 9)                /* Randomization Disable for this descriptor */
#define DCMD_SUBCMD_SHFT 7                        /* Sub command shift */
#define DCMD_SUBCMD_MSK  (3U << DCMD_SUBCMD_SHFT) /* Sub command mask */
#define DCMD_SRB         (1U << 6)                /* Skip Ready/Busy wait */
#define DCMD_SA          (1U << 5)                /* Skip Address phase */
#define DCMD_SD          (1U << 4)                /* Skip Data phase */
#define DCMD_SC2         (1U << 3)                /* Skip second command phase */
#define DCMD_WARDY       (1U << 2)                /* Wait ARDY */
#define DCMD_IRQ_DS      (1U << 1)                /* Descriptor interrupt enable */
#define DCMD_EN          (1U << 0)                /* Descriptor Enable */

/* Descriptor row & control register */
#define DROW_TAGEN (1U << 24) /* Tag enable */

/* Descriptor column & size register */
#define DCOLSIZE_SIZE_SHFT 16 /* Transfer size in bytes */

/* Descriptor status register */
#define DSTS_ECFAIL_SHFT 16                            /* ECC chunk fail bitmap shift */
#define DSTS_ECFAIL_MSK  (0xffffU << DSTS_ECFAIL_SHFT) /* ECC chunk fail bitmap mask */
#define DSTS_UE          (1U << 1)                     /* Uncorrectable ECC error */

/* Descriptor ECC status register */
#define DECCSTS_CEC_SHFT 16                          /* Corrected errors in worst chunk shift */
#define DECCSTS_CEC_MSK  (0xffU << DECCSTS_CEC_SHFT) /* Corrected errors in worst chunk mask */

/* Capability 1 register */
#define CAP1_E1CAP_SHFT   26
#define CAP1_E1CHUNK_SHFT 21
#define CAP1_E1GF_SHFT    16
#define CAP1_E0CAP_SHFT   10
#define CAP1_E0CHUNK_SHFT 5
#define CAP1_E0GF_SHFT    0

#define CAP1_E1CAP   (0x3fU << CAP1_E1CAP_SHFT)
#define CAP1_E1CHUNK (0x1fU << CAP1_E1CHUNK_SHFT)
#define CAP1_E1GF    (0x1fU << CAP1_E1GF_SHFT)
#define CAP1_E0CAP   (0x3fU << CAP1_E0CAP_SHFT)
#define CAP1_E0CHUNK (0x1fU << CAP1_E0CHUNK_SHFT)
#define CAP1_E0GF    (0x1fU << CAP1_E0GF_SHFT)


/* Capability 2/3/4 register */
#define CAP_MSEL_SHFT   31
#define CAP_MSPARE_SHFT 16

#define CAP_MSEL   (1U << CAP_MSEL_SHFT)
#define CAP_MSPARE (0x1fffU << CAP_MSPARE_SHFT)
#define CAP_MDATA  0xffffU


/* ======================== Type Definitions ======================== */


typedef struct {
	u32 ctrl0;    /* 0x000: Core control 0 register */
	u32 ctrl1;    /* 0x004: Core control 1 register */
	u32 ctrl2;    /* 0x008: Core control 2 register */
	u32 ctrl3;    /* 0x00c: Core control 3 register */
	u32 ctrl4;    /* 0x010: Core control 4 register */
	u32 res0[3];  /* 0x014 - 0x01f: Reserved */
	u32 sts0;     /* 0x020: Core status 0 register */
	u32 sts1;     /* 0x024: Core status 1 register */
	u32 sts2;     /* 0x028: Core status 2 register */
	u32 sts3;     /* 0x02c: Core status 3 register */
	u32 res1[2];  /* 0x030 - 0x037: Reserved */
	u32 cap0;     /* 0x038: Capability 0 register */
	u32 cap1;     /* 0x03c: Capability 1 register */
	u32 cap2;     /* 0x040: Capability 2 register */
	u32 cap3;     /* 0x044: Capability 3 register */
	u32 cap4;     /* 0x048: Capability 4 register */
	u32 cap5;     /* 0x04c: Capability 5 register */
	u32 tme0;     /* 0x050: Programmable timing 0 register */
	u32 tme1;     /* 0x054: Programmable timing 1 register */
	u32 tme2;     /* 0x058: Programmable timing 2 register */
	u32 tme3;     /* 0x05c: Programmable timing 3 register */
	u32 tme4;     /* 0x060: Programmable timing 4 register */
	u32 tme5;     /* 0x064: Programmable timing 5 register */
	u32 tme6;     /* 0x068: Programmable timing 6 register */
	u32 tme7;     /* 0x06c: Programmable timing 7 register */
	u32 tme8;     /* 0x070: Programmable timing 8 register */
	u32 tme9;     /* 0x074: Programmable timing 9 register */
	u32 tme10;    /* 0x078: Programmable timing 10 register */
	u32 tme11;    /* 0x07c: Programmable timing 11 register */
	u32 res2[16]; /* 0x080 - 0x0bf: Reserved */
	u32 txskew0;  /* 0x0c0: Skew Control Transfer register */
	u32 rxskew0;  /* 0x0c4: Skew Control Receive register */
	u32 res3[2];  /* 0x0c8 - 0x0cf: Reserved */
	u32 tout0;    /* 0x0d0: Programmable timeout 0 register */
	u32 res4[31]; /* 0x0d4 - 0x14f: Reserved */
	u32 llpl;     /* 0x150: Linked list pointer low register */
	u32 res5;     /* 0x154: Reserved */
	u32 res6[2];  /* 0x158 - 0x15f: Reserved */
	u32 dcmd;     /* 0x160: Descriptor command register */
	u32 dtarsel0; /* 0x164: Descriptor target select 0 register */
	u32 dtarsel1; /* 0x168: Descriptor target select 1 register */
	u32 dchsel;   /* 0x16c: Descriptor channel select register */
	u32 drbsel;   /* 0x170: Descriptor ready/busy select register */
	u32 drow;     /* 0x174: Descriptor row & control register */
	u32 dcolsize; /* 0x178: Descriptor column & size register */
	u32 dsts;     /* 0x17c: Descriptor status register */
	u32 deccsts0; /* 0x180: Descriptor ECC status register */
	u32 res7[3];  /* 0x184 - 0x18f: Reserved */
	u32 ddpl;     /* 0x190: Descriptor data pointer low register */
	u32 res8[19]; /* 0x194 - 0x1df: Reserved */
	u32 din0;     /* 0x1e0: Data-in 0 register */
	u32 din1;     /* 0x1e4: Data-in 1 register */
	u32 din2;     /* 0x1e8: Data-in 2 register */
	u32 din3;     /* 0x1ec: Data-in 3 register */
	u32 dout0;    /* 0x1f0: Data-out 0 register */
	u32 dout1;    /* 0x1f4: Data-out 1 register */
	u32 dout2;    /* 0x1f8: Data-out 2 register */
	u32 dout3;    /* 0x1fc: Data-out 3 register */
} nandfctrl2_regs_t;


/*
 * LLM descriptor - must be 64-byte aligned.
 * dsts and deccsts are written back by hardware after execution.
 */
typedef struct {
	u32 dcmd;     /* 0x00: Command, flags */
	u32 dtarsel0; /* 0x04: Target select low 32 bits */
	u32 dtarsel1; /* 0x08: Target select high 32 bits */
	u32 dchsel;   /* 0x0c: Channel select mask */
	u32 drbsel;   /* 0x10: Ready/Busy select mask */
	u32 drow;     /* 0x14: Row address + control */
	u32 dcolsize; /* 0x18: Size (31:16) | Column address (15:0) */
	u32 dsts;     /* 0x1c: Descriptor status (written by HW) */
	u32 deccsts;  /* 0x20: ECC status (written by HW) */
	u32 res1[3];  /* 0x24-0x2c */
	u32 ddpl;     /* 0x30: DMA data pointer (physical address) */
	u32 res2;     /* 0x34 */
	u32 dllpl;    /* 0x38: Next descriptor physical address (0 = end) */
	u32 res3;     /* 0x3c */
} nandfctrl2_desc_t;


typedef struct {
	u64 ceMask;
	u32 rbMask;
	u32 channelMask;
} nand_layoutMap_t;


typedef struct {
	u32 rowAddr;         /* 24-bit Page/Block address */
	u16 colAddr;         /* 16-bit Byte offset within the page */
	size_t transferSize; /* Number of bytes to read/write */
	addr_t data;         /* RAM pointer for DMA (0 if no data phase) */
} dma_xfer_t;


typedef struct {
	u8 manufacturerId;
	u8 deviceId;
	u8 bytes[3];
} __attribute__((packed)) flash_id_t;


/* Common buffer, exported for use in data.c/meta.c/raw.c */
u8 nandfctrl2_rawBuffer[NAND_MAX_PAGE_SIZE] __attribute__((aligned(64)));


static const nand_layoutMap_t nand_flashMap[NAND_DIE_CNT] = NAND_DIE_MAP;


static struct {
	volatile nandfctrl2_regs_t *regs;

	u8 initialized;

	/* DMA descriptor chain */
	u32 ndesc;
	nandfctrl2_desc_t descs[DMA_MAX_DESCS + 1] __attribute__((aligned(64))); /* +1 for terminator */

	/* Scratch buffer for status reads and small transfers */
